test_new/multiphaseEuler/populationBalance/coalescenceAndBreakup/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (air1 air2 air3 water);

air1
{
    type            pureIsothermalPhaseModel;

    diameterModel
    {
        type            populationBalance;
        populationBalance bubbles;
        nGroups         13;
    }

    residualAlpha   1e-6;
}

air2
{
    type            pureIsothermalPhaseModel;

    diameterModel
    {
        type            populationBalance;
        populationBalance bubbles;
        nGroups         10;
    }

    residualAlpha   1e-6;
}

air3
{
    type            pureIsothermalPhaseModel;

    diameterModel
    {
        type            populationBalance;
        populationBalance bubbles;
        nGroups         8;
    }

    residualAlpha   1e-6;
}

water
{
    type            pureIsothermalPhaseModel;

    diameterModel   none;

    residualAlpha   1e-6;
}

blending
{
    default
    {
        type            continuous;
        phase           water;
    }
}

surfaceTension
{}

bubbles
{
    continuousPhase water;

    sphericalDiameters
    {
        type            exponential;
        min             1.2407009818E+00;
        max             1.2505482270E+01;
    }

    shapeModel      spherical;

    coalescenceModel hydrodynamic;

    breakupModel
    {
        type            exponential;
        C               0.1;
        exponent        0.01;
        daughterSizeDistributionModel uniformBinary;
    }
}

// ************************************************************************* //
